package GUI;

public class login {


    /**
     * -- roadmap
     * -- 로그인화면 실행
     * -- id, pw 입력
     * -- 비빌번호 변경 버튼 -> 비밀번호는 암호화 돼서 찾기는 불가능하고 새로 변경하기만 가능
     * -- 아이디 찾기 -> 이메일, 이름, 전화번호 입력 -> 아이디 보여주기
     *
     * 1. 로그인 성공시
     * new friends(); // 친구 목록창 시작
     *
     * 2. 아이디 찾기
     * emil, 이름, 전화번호가 들어간 데이터베이스에서 아이디 가져오기
     *
     * 3. 비밀번호 변경
     * 아이디, emil, 이름, 전화번호가 들어간 데이터베이스에 비밀번호 새로 입력
     * pw.md(pw.getPassword)
     *
     * 4. 회원가입 누르면
     * new signup();
     *
     * 5. 로그인 실패시
     * System.out.println("아이디 또는 비밀번호가 틀렸습니다.");
     *
     *
     */
}
